In [ ]:
#Importación de librerías
import pandas as pd
import os
from sqlalchemy  import create_engine  as sql
from dotenv import load_dotenv

In [ ]:
#Cargar las variables de entorno
load_dotenv()
#Variables para la conexión a las base de datos
name_db = os.getenv('DB_NAME')
name_db2 = os.getenv('DB_NAME2')
user_db = os.getenv('DB_USER')
password_db = os.getenv('DB_PASSWORD')
host_db = os.getenv('DB_HOST')
port_db = os.getenv('DB_PORT')

In [ ]:
#Conexión a la base de datos movies_netflix_db
try:
    engine = sql(f"postgresql+psycopg://{user_db}:{password_db}@{host_db}:{port_db}/{name_db}")
    print(f'Conexion exitosa a la base de datos {name_db}')
except Exception as e:
    print('Error al conectarte a la base de datos:', e)

Conexion exitosa a la base de datos movies_netflix_db

In [ ]:
#Query para obtener los datos de la base de datos
query = """
select 
    movies.movieID as "movieID", 
    movies.title as "title",
    movies.releaseDate as "releaseDate", 
    gender.name as "gender", 
    person.name as "participantName", 
    participant.participantRole as "roleParticipant"
from movies 
inner join participant 
    on movies.movieID = participant.movieID
inner join person
    on participant.personID = person.personID
inner join movieGender
    on movies.movieID = movieGender.movieID
inner join gender
    on movieGender.genderID = gender.genderID;
"""
#Leemos los datos de la base de datos y se almacenan en un dataframe
movies_df = pd.read_sql(query, engine)
#Cambiamos el tipo de dato de la columna movieID
movies_df['movieID'] = movies_df['movieID'].astype(int)
# movies_df.columns = [col[0].upper() + col[1:] for col in movies_df.columns]
#Mostramos el dataframe
movies_df

movies_netflix_db localhost

,movieID,title,releaseDate,gender,participantName,roleParticipant
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor
1,81157374,Run,2021-05-21,Adventure,Maria Lopez Gutierrez,Director
2,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor

In [ ]:
#Cargamos el archivo csv de las peliculas en el dataframe
movies_award_df = pd.read_csv('../Data/Awards_movie.csv')
# print(movies_award_df.dtypes)
#Renombramos la columna
movies_award_df.rename(columns={'Aware':'Award'},inplace=True)
# movies_award_df.columns = [col[0].upper() + col[1:] for col in movies_award_df.columns]
# movies_award_df.columns = movies_award_df.columns.str.capitalize()
#mostramos el dataframe
movies_award_df

    movieID  IdAward   Award
0  80210920        0   Oscar
1  81157374        1  Grammy
2  80192187        2   Oscar

In [11]:
movies_df = pd.merge(movies_df, movies_award_df, left_on='movieID', right_on='movieID')
movies_df

,movieID,title,releaseDate,gender,participantName,roleParticipant,IdAward,Award
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,2,Oscar
1,81157374,Run,2021-05-21,Adventure,Maria Lopez Gutierrez,Director,1,Grammy
2,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,0,Oscar

In [ ]:
#Conexión a la base de datos mnetflix_db
try:
    engine = sql(f"postgresql+psycopg://{user_db}:{password_db}@{host_db}:{port_db}/{name_db2}")
    print(f'Conexion exitosa a la base de datos {name_db2}')
except Exception as e:
    print('Error al conectarte a la base de datos:', e)

Conexion exitosa a la base de datos netflix_db

In [ ]:
#Renombramos una columna y eliminamos otra 
movies_df = movies_df.rename(columns = {'Award': 'awardMovie'})
movies_df = movies_df.drop(columns=['IdAward'])
movies_df.head()

,movieID,title,releaseDate,gender,participantName,roleParticipant,awardMovie
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,Oscar
1,81157374,Run,2021-05-21,Adventure,Maria Lopez Gutierrez,Director,Grammy
2,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,Oscar

In [ ]:
#Cargamos el dataframe a la base de datos
movies_df.to_sql('movies', engine, if_exists='append', index=False)

Engine(postgresql+psycopg://postgres:***@localhost:5432/netflix_db)

-1

In [ ]:
#Mostramos la tabla movies de la base de datos
pd.read_sql('movies', engine)

,movieID,title,releaseDate,gender,participantName,roleParticipant,awardMovie
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,Oscar
1,81157374,Run,2021-05-21,Adventure,Maria Lopez Gutierrez,Director,Grammy
2,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,Oscar

In [ ]:
#Cargamos el archivo csv de los usuarios en el dataframe y mostramos las primeras filas
users_df = pd.read_csv('../Data/users.csv', sep='|')
users_df.head()

    idUser     username    country subscription
0  1002331      user123        USA      Premium
1  1002332  gamerGirl97     Canada        Basic
2  1002333   techMaster         UK      Premium
3  1002334    soccerFan     Brazil        Basic
4  1002335    travelBug  Australia      Premium

In [ ]:
#Renombramos las columnas del dataframe de usuarios
users_df = users_df.rename(columns={'idUser':'userID', 'username': 'userName'})
users_df.head()

    userID     userName    country subscription
0  1002331      user123        USA      Premium
1  1002332  gamerGirl97     Canada        Basic
2  1002333   techMaster         UK      Premium
3  1002334    soccerFan     Brazil        Basic
4  1002335    travelBug  Australia      Premium

In [ ]:
#Cargamos el dataframa a la base de datos
users_df.to_sql('users', engine, if_exists='append', index=False)

-1

In [ ]:
#Almacenamos los id de las tablas movies y users
user_id = users_df['userID']
movie_id = movies_df['movieID']
# pd.read_sql('users', engine)
# user_id
# movie_id

0    80192187
1    81157374
2    80210920
Name: movieID, dtype: int64

In [ ]:
#Creamos un dataframe con la combinación de los id de las tablas movies y users, almacenamos el resultodo en el dataframe
watchs_df = pd.merge(user_id, movie_id, how='cross')
watchs_df

      userID   movieID
0    1002331  80192187
1    1002331  81157374
2    1002331  80210920
3    1002332  80192187
4    1002332  81157374
5    1002332  80210920
6    1002333  80192187
7    1002333  81157374
8    1002333  80210920
9    1002334  80192187
10   1002334  81157374
11   1002334  80210920
12   1002335  80192187
13   1002335  81157374
14   1002335  80210920
15   1002336  80192187
16   1002336  81157374
17   1002336  80210920
18   1002337  80192187
19   1002337  81157374
20   1002337  80210920
21   1002338  80192187
22   1002338  81157374
23   1002338  80210920
24   1002339  80192187
25   1002339  81157374
26   1002339  80210920
27  10023310  80192187
28  10023310  81157374
29  10023310  80210920
30  10023311  80192187
31  10023311  81157374
32  10023311  80210920
33  10023312  80192187
34  10023312  81157374
35  10023312  80210920
36  10023313  80192187
37  10023313  81157374
38  10023313  80210920
39  10023314  80192187
40  10023314  81157374
41  10023314  80210920
42  10023315  80192187
43  10023315  81157374
44  10023315  80210920
45  10023316  80192187
46  10023316  81157374
47  10023316  80210920
48  10023317  80192187
49  10023317  81157374
50  10023317  80210920
51  10023318  80192187
52  10023318  81157374
53  10023318  80210920
54  10023319  80192187
55  10023319  81157374
56  10023319  80210920
57  10023320  80192187
58  10023320  81157374
59  10023320  80210920

In [ ]:
import random
from datetime import datetime, timedelta
import random
#Generamos un número aleatorio entre 0 y 5 con un decimal, para simular una puntuación
def gen_rating():
    numero_aleatorio = round(random.uniform(0, 5), 1)
    return numero_aleatorio
#Generamos una fecha aleatoria entre enero y abril de 2024, para simular la fecha
def gen_timestamp():
    start_date = datetime(2024, 1, 15)
    end_date = datetime(2024, 4, 6)
    random_date = start_date + timedelta( seconds = random.randint(0, int((end_date - start_date).total_seconds())))
    return random_date

In [ ]:
#Agregamos las columnas de rating y timestamp al dataframe, le asignamos un valor utilizando las funciones creadas anteriormente y mostramos el dataframe
watchs_df["rating"] = watchs_df["movieID"].apply(lambda x: gen_rating())
watchs_df["timestamp"] = watchs_df["userID"].apply(lambda x: gen_timestamp())
watchs_df

      userID   movieID  rating           timestamp
0    1002331  80192187     4.8 2024-02-15 13:39:39
1    1002331  81157374     3.5 2024-02-23 02:38:11
2    1002331  80210920     3.6 2024-03-26 03:51:57
3    1002332  80192187     0.5 2024-02-13 10:31:09
4    1002332  81157374     0.3 2024-03-25 04:58:38
5    1002332  80210920     3.9 2024-02-01 02:41:34
6    1002333  80192187     0.5 2024-01-19 09:10:33
7    1002333  81157374     1.9 2024-04-05 07:42:56
8    1002333  80210920     2.7 2024-03-02 11:53:58
9    1002334  80192187     5.0 2024-01-21 23:15:06
10   1002334  81157374     0.8 2024-03-26 20:28:52
11   1002334  80210920     2.0 2024-03-27 16:57:19
12   1002335  80192187     1.1 2024-02-10 12:16:07
13   1002335  81157374     4.6 2024-04-03 22:32:41
14   1002335  80210920     1.6 2024-03-12 20:46:53
15   1002336  80192187     3.0 2024-03-30 23:43:22
16   1002336  81157374     0.6 2024-02-11 20:52:06
17   1002336  80210920     4.8 2024-01-20 02:19:52
18   1002337  80192187     3.4 2024-02-11 20:29:21
19   1002337  81157374     4.4 2024-01-22 17:54:23
20   1002337  80210920     2.2 2024-03-18 17:42:29
21   1002338  80192187     4.4 2024-02-21 22:48:01
22   1002338  81157374     3.0 2024-01-17 02:13:55
23   1002338  80210920     2.4 2024-02-03 21:07:52
24   1002339  80192187     0.2 2024-02-16 08:56:12
25   1002339  81157374     1.8 2024-01-27 17:54:19
26   1002339  80210920     2.5 2024-01-15 15:25:06
27  10023310  80192187     2.0 2024-01-21 18:13:46
28  10023310  81157374     1.5 2024-02-08 02:42:07
29  10023310  80210920     0.1 2024-01-20 15:38:37
30  10023311  80192187     4.6 2024-02-08 13:53:45
31  10023311  81157374     1.1 2024-02-21 04:54:06
32  10023311  80210920     2.9 2024-03-02 21:02:18
33  10023312  80192187     3.0 2024-03-22 10:00:49
34  10023312  81157374     0.5 2024-03-27 21:46:37
35  10023312  80210920     3.2 2024-02-07 03:29:17
36  10023313  80192187     4.2 2024-01-28 14:12:28
37  10023313  81157374     0.8 2024-02-25 05:05:10
38  10023313  80210920     1.3 2024-02-11 05:54:26
39  10023314  80192187     0.1 2024-02-15 07:29:07
40  10023314  81157374     3.9 2024-02-13 10:29:31
41  10023314  80210920     0.9 2024-03-24 02:19:57
42  10023315  80192187     3.5 2024-02-16 06:49:01
43  10023315  81157374     1.3 2024-03-01 00:53:21
44  10023315  80210920     4.3 2024-03-17 10:26:27
45  10023316  80192187     4.2 2024-02-07 08:17:28
46  10023316  81157374     0.7 2024-02-06 15:40:23
47  10023316  80210920     3.4 2024-04-01 15:54:32
48  10023317  80192187     4.6 2024-03-26 03:32:42
49  10023317  81157374     3.6 2024-02-25 14:15:13
50  10023317  80210920     4.3 2024-01-18 06:44:54
51  10023318  80192187     2.8 2024-04-04 23:59:37
52  10023318  81157374     1.6 2024-02-19 21:22:50
53  10023318  80210920     0.8 2024-02-07 05:05:51
54  10023319  80192187     0.1 2024-03-14 15:40:52
55  10023319  81157374     4.9 2024-03-23 20:52:19
56  10023319  80210920     4.2 2024-01-21 13:03:04
57  10023320  80192187     4.0 2024-01-21 18:24:22
58  10023320  81157374     1.6 2024-01-20 02:47:25
59  10023320  80210920     4.9 2024-01-25 21:28:56

In [ ]:
#Cargamos el dataframe a la base de datos
watchs_df.to_sql('observations', engine, if_exists='append', index=False)

-1